
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>少样本提示技术 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="COT.html" />
    
    
    <link rel="prev" href="zero-shot.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../part1/">
            
                <a href="../part1/">
            
                    
                    提示工程简介
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../part1/conception.html">
            
                <a href="../part1/conception.html">
            
                    
                    基本概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../part1/element.html">
            
                <a href="../part1/element.html">
            
                    
                    提示词要素
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../part1/General-tips.html">
            
                <a href="../part1/General-tips.html">
            
                    
                    提示词通用技巧
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    提示词技术介绍
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="zero-shot.html">
            
                <a href="zero-shot.html">
            
                    
                    零样本提示技术
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="few-shot.html">
            
                <a href="few-shot.html">
            
                    
                    少样本提示技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="COT.html">
            
                <a href="COT.html">
            
                    
                    链式思考（CoT）提示
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="RAG.html">
            
                <a href="RAG.html">
            
                    
                    检索增强生成 (RAG)提示
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="TOT.html">
            
                <a href="TOT.html">
            
                    
                    思维树 (ToT)提示
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../part3/">
            
                <a href="../part3/">
            
                    
                    应用案例
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../part3/">
            
                <a href="../part3/">
            
                    
                    软件工程领域
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="../part3/software-engineering/test-engineer.html">
            
                <a href="../part3/software-engineering/test-engineer.html">
            
                    
                    测试工程师
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="../part3/software-engineering/product-manager.html">
            
                <a href="../part3/software-engineering/product-manager.html">
            
                    
                    产品经理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.3" data-path="../part3/software-engineering/development-engineer.html">
            
                <a href="../part3/software-engineering/development-engineer.html">
            
                    
                    研发工程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" data-path="../part3/software-engineering/operation.html">
            
                <a href="../part3/software-engineering/operation.html">
            
                    
                    互联网运营
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../part3/feedback_please.md">
            
                <span>
            
                    
                    教育培训领域
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../part3/better_tools.md">
            
                <span>
            
                    
                    文化娱乐领域
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    [潜在风险]
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" >
            
                <span>
            
                    
                    [对抗性提示]
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    [回答偏见]
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >少样本提示技术</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5C11;&#x6837;&#x672C;&#x63D0;&#x793A;">&#x5C11;&#x6837;&#x672C;&#x63D0;&#x793A;</h1>
<p>&#x5C11;&#x6837;&#x672C;&#x63D0;&#x793A;&#x8BCD;&#x4E3B;&#x8981;&#x662F;&#x4EE5;&#x5411;&#x5927;&#x6A21;&#x578B;&#x4E3E;&#x4F8B;&#x5B50;&#x63D0;&#x95EE;&#x7684;&#x65B9;&#x5F0F;</p>
<ul>
<li>&#x8F93;&#x5165;</li>
</ul>
<pre><code>&#x201C;7&#x6708;29&#x65E5;&#xFF0C;&#x7B2C;&#x4E09;&#x65B9;&#x5E02;&#x573A;&#x7814;&#x7A76;&#x673A;&#x6784;Canalys&#x516C;&#x5E03;&#x4E86;2022&#x5E74;&#x7B2C;&#x4E8C;&#x5B63;&#x5EA6;&#x4E2D;&#x56FD;&#x667A;&#x80FD;&#x624B;&#x673A;&#x51FA;&#x8D27;&#x91CF;&#x60C5;&#x51B5;&#x3002;&#x53D7;&#x5230;&#x75AB;&#x60C5;&#x5F71;&#x54CD;&#xFF0C;&#x5927;&#x5BB6;&#x7684;&#x8D2D;&#x673A;&#x70ED;&#x60C5;&#x6CA1;&#x6709;&#x4EE5;&#x5F80;&#x9AD8;&#x6DA8;&#xFF0C;&#x4ECA;&#x5E74;&#x7B2C;&#x4E8C;&#x5B63;&#x5EA6;&#x667A;&#x80FD;&#x624B;&#x673A;&#x51FA;&#x8D27;&#x91CF;&#x540C;&#x6BD4;&#x4E0B;&#x964D;&#x4E86;10%&#xFF0C;&#x51FA;&#x8D27;&#x91CF;&#x4EC5;&#x4E3A;6740&#x4E07;&#x90E8;&#x3002;&#x5176;&#x4E2D;&#xFF0C;vivo&#x51FA;&#x8D27;&#x91CF;&#x4E3A;1320&#x4E07;&#x53F0;&#xFF0C;&#x6392;&#x540D;&#x7B2C;&#x4E00;&#xFF1B;&#x8363;&#x8000;&#x7D27;&#x968F;&#x5176;&#x540E;&#xFF0C;&#x51FA;&#x8D27;&#x91CF;&#x4E3A;1300&#x4E07;&#x90E8;&#xFF1B;OPPO&#xFF08;&#x5305;&#x62EC;&#x4E00;&#x52A0;&#xFF09;&#x4EE5;1180&#x4E07;&#x90E8;&#x7684;&#x51FA;&#x8D27;&#x91CF;&#x6392;&#x5728;&#x7B2C;&#x4E09;&#x540D;&#xFF1B;&#x5C0F;&#x7C73;&#x4EE5;1060&#x4E07;&#x53F0;&#x7684;&#x51FA;&#x8D27;&#x91CF;&#x6392;&#x540D;&#x7B2C;&#x56DB;&#xFF1B;&#x82F9;&#x679C;&#x6392;&#x540D;&#x7B2C;&#x4E94;&#xFF0C;&#x51FA;&#x8D27;&#x91CF;&#x4E3A;990&#x4E07;&#x53F0;&#x3002;&#x5728;&#x624B;&#x673A;&#x5E02;&#x573A;&#x6574;&#x4F53;&#x75B2;&#x8F6F;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x4ECA;&#x5E74;&#x7B2C;&#x4E8C;&#x5B63;&#x5EA6;&#xFF0C;&#x624B;&#x673A;&#x5382;&#x5546;&#x4EEC;&#x7684;&#x51FA;&#x8D27;&#x91CF;&#x5448;&#x73B0;&#x51FA;&#x4E86;&#x4E24;&#x4F4D;&#x6570;&#x7684;&#x4E0B;&#x6ED1;&#xFF0C;&#x53EA;&#x6709;&#x8363;&#x8000;&#x548C;&#x82F9;&#x679C;&#x5B9E;&#x73B0;&#x4E86;&#x9006;&#x52BF;&#x589E;&#x957F;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x8363;&#x8000;&#x5E74;&#x589E;&#x957F;&#x7387;&#x8FBE;&#x5230;88%&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x8FC7;&#x4E8E;&#x5938;&#x5F20;&#x3002;&#x82F9;&#x679C;&#x5E74;&#x589E;&#x957F;&#x7387;&#x4E5F;&#x8FBE;&#x5230;&#x4E86;25%&#xFF0C;&#x8F83;&#x4E3A;&#x7A33;&#x5065;&#x3002;&#x201D;
vivo&#x3010;&#x4E2D;&#x6027;&#x3011;&#xFF1A;&#x867D;&#x7136;&#x51FA;&#x8D27;&#x91CF;&#x7B2C;&#x4E00;&#xFF0C;&#x4F46;&#x662F;&#x51FA;&#x8D27;&#x91CF;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4E0B;&#x6ED1;
&#x8363;&#x8000;&#x3010;&#x6B63;&#x9762;&#x3011;&#xFF1A;&#x9500;&#x552E;&#x91CF;&#x4EC5;&#x6B64;&#x4E8E;vivo&#xFF0C;&#x4E14;&#x5B9E;&#x73B0;&#x4E86;&#x9006;&#x52BF;&#x589E;&#x957F;
&#x5C0F;&#x7C73;&#x3010;&#x4E2D;&#x6027;&#x3011;&#xFF1A;&#x51FA;&#x8D27;&#x91CF;&#x4E2D;&#x89C4;&#x4E2D;&#x77E9;
&#x82F9;&#x679C;&#x3010;&#x6B63;&#x9762;&#x3011;&#xFF1A;&#x867D;&#x7136;&#x51FA;&#x8D27;&#x91CF;&#x8F83;&#x5C11;&#xFF0C;&#x4F46;&#x4E5F;&#x5B9E;&#x73B0;&#x4E86;&#x9006;&#x52BF;&#x589E;&#x957F;

&#x201C;&#x5728;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x8FD9;&#x6837;&#x7684;&#x589E;&#x957F;&#x52BF;&#x5934;&#x4E0B;&#xFF0C;2023&#x5E74;&#x5C31;&#x4E0D;&#x53EA;&#x662F;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x5E02;&#x573A;&#x6D17;&#x724C;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x6324;&#x538B;&#x71C3;&#x6CB9;&#x8F66;&#x578B;&#x7684;&#x751F;&#x5B58;&#x7A7A;&#x95F4;&#x3002;&#x65E5;&#x7CFB;&#x3001;&#x5FB7;&#x7CFB;&#x7684;&#x4E09;&#x5927;&#x9500;&#x51A0;&#x8F66;&#x578B;&#x8F69;&#x9038;&#x3001;&#x65B0;&#x6717;&#x9038;&#x3001;&#x5361;&#x7F57;&#x62C9;&#x9500;&#x91CF;&#x5728;&#x5E74;&#x672B;&#x751A;&#x81F3;&#x51FA;&#x73B0;&#x4E86;&#x8170;&#x65A9;&#x73B0;&#x8C61;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x660E;&#x5E74;&#x5BF9;&#x4E8E;&#x71C3;&#x6CB9;&#x8F66;&#x578B;&#x66F4;&#x52A0;&#x8270;&#x96BE;&#x3002;&#x5FB7;&#x7CFB;&#x3001;&#x65E5;&#x7CFB;&#x9500;&#x91CF;&#x7684;&#x8170;&#x65A9;&#xFF0C;&#x4E5F;&#x5C06;&#x8FDB;&#x4E00;&#x6B65;&#x5F71;&#x54CD;&#x5408;&#x8D44;&#x5382;&#xFF0C;&#x4EE5;&#x4E0A;&#x6C7D;&#x3001;&#x4E00;&#x6C7D;&#x3001;&#x5E7F;&#x6C7D;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x592E;&#x4F01;&#x6C7D;&#x8F66;&#x96C6;&#x56E2;&#x4E3B;&#x8981;&#x5229;&#x6DA6;&#x90FD;&#x6765;&#x81EA;&#x4E8E;&#x5408;&#x8D44;&#x8F66;&#x578B;&#x7684;&#x5206;&#x6DA6;&#xFF0C;&#x5FB7;&#x7CFB;&#x65E5;&#x7CFB;&#x5012;&#x4E0B;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x4E8F;&#x635F;&#x4E5F;&#x5C06;&#x662F;&#x975E;&#x5E38;&#x60CA;&#x4EBA;&#x7684;&#x3002;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x7684;&#x6D17;&#x724C;&#xFF0C;&#x5DF2;&#x7ECF;&#x6D17;&#x5230;&#x4E86;&#x6DF1;&#x6C34;&#x533A;&#x3002;&#x6BD4;&#x4E9A;&#x8FEA;&#x4ECA;&#x5E74;&#x9500;&#x91CF;&#x5B9E;&#x73B0;&#x4E86;2&#x500D;&#x4EE5;&#x4E0A;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x4E00;&#x5BB6;&#x5382;&#x5546;&#x7684;&#x9500;&#x91CF;&#x5360;&#x6BD4;&#x8D85;&#x8FC7;33%&#xFF0C;&#x8FD9;&#x5728;&#x56FD;&#x5185;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#x662F;&#x521B;&#x9020;&#x5386;&#x53F2;&#x7684;&#x7EAA;&#x5F55;&#xFF0C;&#x968F;&#x7740;&#x6BD4;&#x4E9A;&#x8FEA;&#x8D70;&#x51FA;&#x56FD;&#x95E8;&#xFF0C;&#x5728;&#x591A;&#x4E2A;&#x5730;&#x533A;&#x7684;&#x9500;&#x91CF;&#x4E5F;&#x53D6;&#x5F97;&#x4E86;&#x8F83;&#x597D;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x8FD9;&#x662F;&#x4EA7;&#x54C1;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x4F53;&#x73B0;&#x3002;&#x5728;&#x56FD;&#x5185;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x9500;&#x91CF;&#x8FBE;&#x5230;100%&#x7684;&#x589E;&#x957F;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5409;&#x5229;&#x6C7D;&#x8F66;&#x3001;&#x5E7F;&#x6C7D;&#x57C3;&#x5B89;&#x3001;&#x5947;&#x745E;&#x6C7D;&#x8F66;&#x3001;&#x957F;&#x5B89;&#x6C7D;&#x8F66;&#x3001;&#x54EA;&#x5412;&#x6C7D;&#x8F66;&#x3001;&#x96F6;&#x8DD1;&#x6C7D;&#x8F66;&#x8DD1;&#x8D62;&#x4E86;&#x5927;&#x76D8;&#x3002;&#x800C;&#x7279;&#x65AF;&#x62C9;&#x3001;&#x7406;&#x60F3;&#x6C7D;&#x8F66;&#x3001;&#x5C0F;&#x9E4F;&#x6C7D;&#x8F66;&#x3001;&#x851A;&#x6765;&#x6C7D;&#x8F66;&#x3001;&#x4E00;&#x6C7D;&#x5927;&#x4F17;&#x3001;&#x4E0A;&#x6C7D;&#x5927;&#x4F17;&#x90FD;&#x4E0D;&#x5C3D;&#x5982;&#x4EBA;&#x610F;&#x3002;&#x5C24;&#x5176;&#x662F;&#x5357;&#x5317;&#x5927;&#x4F17;&#x66FE;&#x662F;&#x71C3;&#x6CB9;&#x8F66;&#x65F6;&#x4EE3;&#x7684;&#x9886;&#x8DD1;&#x8005;&#xFF0C;&#x5982;&#x4ECA;&#x968F;&#x7740;&#x5FB7;&#x7CFB;&#x7535;&#x52A8;&#x5316;&#x8F6C;&#x578B;&#x8F83;&#x6162;&#xFF0C;&#x81EA;&#x4E3B;&#x54C1;&#x724C;&#x9752;&#x9EC4;&#x4E0D;&#x63A5;&#xFF0C;&#x5E02;&#x573A;&#x4EFD;&#x989D;&#x5DF2;&#x7ECF;&#x662F;&#x96F6;&#x5934;&#xFF0C;&#x65E0;&#x7591;&#x9762;&#x4E34;&#x7740;&#x6781;&#x5927;&#x7684;&#x8F6C;&#x578B;&#x538B;&#x529B;&#x3002;&#x4E0A;&#x6C7D;&#x901A;&#x7528;&#x4E94;&#x83F1;&#x867D;&#x7136;&#x51ED;&#x501F;&#x7740;min EV&#x7CFB;&#x5217;&#x8D5A;&#x8DB3;&#x4E86;&#x773C;&#x7403;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x65B0;&#x7684;&#x7206;&#x6B3E;&#x4EA7;&#x54C1;&#xFF0C;&#x589E;&#x957F;&#x4EE5;&#x53CA;&#x505C;&#x6EDE;&#xFF1B;&#x800C;&#x957F;&#x57CE;&#x6C7D;&#x8F66;&#x65B0;&#x80FD;&#x6E90;&#x8F66;&#x578B;&#x7684;&#x9500;&#x91CF;&#x589E;&#x957F;&#x5DF2;&#x7ECF;&#x9677;&#x5165;&#x505C;&#x6EDE;&#xFF0C;&#x4FA7;&#x9762;&#x8BF4;&#x660E;&#x5176;&#x65B0;&#x80FD;&#x6E90;&#x5316;&#x8F6C;&#x578B;&#x7684;&#x4E25;&#x91CD;&#x6EDE;&#x540E;&#xFF0C;&#x4E0E;&#x540C;&#x6BB5;&#x4F4D;&#x7684;&#x5409;&#x5229;&#x3001;&#x5947;&#x745E;&#x5F62;&#x6210;&#x4E86;&#x9C9C;&#x660E;&#x5BF9;&#x6BD4;&#xFF0C;&#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#x4E86;&#x6389;&#x961F;&#x7684;&#x5F81;&#x5146;&#x3002;&#x201D;
</code></pre><ul>
<li>&#x8F93;&#x51FA;</li>
</ul>
<pre><code>&#x6B63;&#x9762;&#x60C5;&#x611F;&#xFF1A;

&#x6BD4;&#x4E9A;&#x8FEA;&#xFF1A; &#x6BD4;&#x4E9A;&#x8FEA;&#x5728;2022&#x5E74;&#x5B9E;&#x73B0;&#x4E86;&#x9500;&#x91CF;&#x589E;&#x957F;&#x8D85;&#x8FC7;&#x4E24;&#x500D;&#xFF0C;&#x4E00;&#x5BB6;&#x5382;&#x5546;&#x7684;&#x9500;&#x91CF;&#x5360;&#x6BD4;&#x8D85;&#x8FC7;33%&#x3002;&#x8FD9;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x521B;&#x9020;&#x5386;&#x53F2;&#x7684;&#x7EAA;&#x5F55;&#xFF0C;&#x5E76;&#x4E14;&#x88AB;&#x89C6;&#x4E3A;&#x4EA7;&#x54C1;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x4F53;&#x73B0;&#x3002;&#x8FD9;&#x8868;&#x660E;&#x6BD4;&#x4E9A;&#x8FEA;&#x5728;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x5E02;&#x573A;&#x4E0A;&#x8868;&#x73B0;&#x51FA;&#x8272;&#x3002;

&#x5409;&#x5229;&#x6C7D;&#x8F66;&#x3001;&#x5E7F;&#x6C7D;&#x57C3;&#x5B89;&#x3001;&#x5947;&#x745E;&#x6C7D;&#x8F66;&#x3001;&#x957F;&#x5B89;&#x6C7D;&#x8F66;&#x3001;&#x54EA;&#x5412;&#x6C7D;&#x8F66;&#x3001;&#x96F6;&#x8DD1;&#x6C7D;&#x8F66;&#xFF1A; &#x8FD9;&#x4E9B;&#x5382;&#x5546;&#x88AB;&#x79F0;&#x4E3A;&#x5728;&#x56FD;&#x5185;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x9500;&#x91CF;&#x589E;&#x957F;100%&#x7684;&#x80CC;&#x666F;&#x4E0B;&#x53D6;&#x5F97;&#x6210;&#x529F;&#xFF0C;&#x6210;&#x529F;&#x5730;&#x8D62;&#x5F97;&#x4E86;&#x5E02;&#x573A;&#x4EFD;&#x989D;&#x3002;&#x8FD9;&#x88AB;&#x89C6;&#x4E3A;&#x4ED6;&#x4EEC;&#x5728;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x9886;&#x57DF;&#x7684;&#x79EF;&#x6781;&#x8868;&#x73B0;&#x3002;

&#x82E5;&#x5E72;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x516C;&#x53F8;&#xFF1A; &#x5728;&#x6574;&#x4E2A;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x5E02;&#x573A;&#x589E;&#x957F;&#x7684;&#x5927;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5927;&#x76D8;&#x7684;&#x8D62;&#x5BB6;&#xFF0C;&#x8FD9;&#x5728;&#x60C5;&#x611F;&#x4E0A;&#x88AB;&#x89C6;&#x4E3A;&#x6B63;&#x9762;&#x56E0;&#x7D20;&#x3002;

&#x8D1F;&#x9762;&#x60C5;&#x611F;&#xFF1A;

&#x5FB7;&#x7CFB;&#x3001;&#x65E5;&#x7CFB;&#x8F66;&#x578B;&#xFF08;&#x8F69;&#x9038;&#x3001;&#x65B0;&#x6717;&#x9038;&#x3001;&#x5361;&#x7F57;&#x62C9;&#xFF09;&#xFF1A; &#x8FD9;&#x4E9B;&#x8F66;&#x578B;&#x5728;&#x63D0;&#x5230;&#x5B83;&#x4EEC;&#x7684;&#x9500;&#x91CF;&#x65F6;&#x51FA;&#x73B0;&#x4E86;&#x8170;&#x65A9;&#x73B0;&#x8C61;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x5728;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x5E02;&#x573A;&#x4E2D;&#x9762;&#x4E34;&#x8270;&#x96BE;&#x3002;&#x8FD9;&#x88AB;&#x89C6;&#x4E3A;&#x8D1F;&#x9762;&#x56E0;&#x7D20;&#x3002;

&#x5357;&#x5317;&#x5927;&#x4F17;&#xFF1A; &#x66FE;&#x7ECF;&#x662F;&#x71C3;&#x6CB9;&#x8F66;&#x65F6;&#x4EE3;&#x7684;&#x9886;&#x8DD1;&#x8005;&#x7684;&#x5357;&#x5317;&#x5927;&#x4F17;&#xFF0C;&#x5982;&#x4ECA;&#x968F;&#x7740;&#x7535;&#x52A8;&#x5316;&#x8F6C;&#x578B;&#x8F83;&#x6162;&#xFF0C;&#x81EA;&#x4E3B;&#x54C1;&#x724C;&#x7ADE;&#x4E89;&#x4E0D;&#x4F73;&#xFF0C;&#x5E02;&#x573A;&#x4EFD;&#x989D;&#x5DF2;&#x7ECF;&#x5F88;&#x5C0F;&#xFF0C;&#x9762;&#x4E34;&#x7740;&#x6781;&#x5927;&#x7684;&#x8F6C;&#x578B;&#x538B;&#x529B;&#x3002;&#x8FD9;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x8D1F;&#x9762;&#x60C5;&#x51B5;&#x3002;

&#x7279;&#x65AF;&#x62C9;&#x3001;&#x7406;&#x60F3;&#x6C7D;&#x8F66;&#x3001;&#x5C0F;&#x9E4F;&#x6C7D;&#x8F66;&#x3001;&#x851A;&#x6765;&#x6C7D;&#x8F66;&#x3001;&#x4E00;&#x6C7D;&#x5927;&#x4F17;&#x3001;&#x4E0A;&#x6C7D;&#x5927;&#x4F17;&#x7B49;&#xFF1A; &#x8FD9;&#x4E9B;&#x5382;&#x5546;&#x5728;&#x63D0;&#x5230;&#x5B83;&#x4EEC;&#x65F6;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x4E0D;&#x5C3D;&#x5982;&#x4EBA;&#x610F;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x65B0;&#x80FD;&#x6E90;&#x6C7D;&#x8F66;&#x5E02;&#x573A;&#x4E2D;&#x9762;&#x4E34;&#x6311;&#x6218;&#x3002;

&#x4E0A;&#x6C7D;&#x901A;&#x7528;&#x4E94;&#x83F1;&#x548C;&#x957F;&#x57CE;&#x6C7D;&#x8F66;&#xFF1A; &#x4E0A;&#x6C7D;&#x901A;&#x7528;&#x4E94;&#x83F1;&#x867D;&#x7136;&#x5F15;&#x8D77;&#x4E86;&#x6CE8;&#x610F;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x65B0;&#x7684;&#x7206;&#x6B3E;&#x4EA7;&#x54C1;&#xFF0C;&#x589E;&#x957F;&#x505C;&#x6EDE;&#x3002;&#x957F;&#x57CE;&#x6C7D;&#x8F66;&#x65B0;&#x80FD;&#x6E90;&#x8F66;&#x578B;&#x7684;&#x9500;&#x91CF;&#x589E;&#x957F;&#x4E5F;&#x9677;&#x5165;&#x505C;&#x6EDE;&#xFF0C;&#x663E;&#x793A;&#x51FA;&#x5176;&#x65B0;&#x80FD;&#x6E90;&#x5316;&#x8F6C;&#x578B;&#x6EDE;&#x540E;&#xFF0C;&#x4E0E;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x5F62;&#x6210;&#x9C9C;&#x660E;&#x5BF9;&#x6BD4;&#xFF0C;&#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#x4E86;&#x6389;&#x961F;&#x7684;&#x8FF9;&#x8C61;&#x3002;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x8D1F;&#x9762;&#x56E0;&#x7D20;&#x3002;
</code></pre>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="zero-shot.html" class="navigation navigation-prev " aria-label="Previous page: 零样本提示技术">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="COT.html" class="navigation navigation-next " aria-label="Next page: 链式思考（CoT）提示">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"少样本提示技术","level":"1.3.2","depth":2,"next":{"title":"链式思考（CoT）提示","level":"1.3.3","depth":2,"path":"part2/COT.md","ref":"part2/COT.md","articles":[]},"previous":{"title":"零样本提示技术","level":"1.3.1","depth":2,"path":"part2/zero-shot.md","ref":"part2/zero-shot.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part2/few-shot.md","mtime":"2023-10-25T03:24:44.541Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-10-25T03:25:19.021Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

