
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>提示词通用技巧 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../part2/" />
    
    
    <link rel="prev" href="element.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    提示工程简介
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="conception.html">
            
                <a href="conception.html">
            
                    
                    基本概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="element.html">
            
                <a href="element.html">
            
                    
                    提示词要素
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="General-tips.html">
            
                <a href="General-tips.html">
            
                    
                    提示词通用技巧
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../part2/">
            
                <a href="../part2/">
            
                    
                    提示词技术介绍
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../part2/zero-shot.html">
            
                <a href="../part2/zero-shot.html">
            
                    
                    零样本提示技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../part2/few-shot.html">
            
                <a href="../part2/few-shot.html">
            
                    
                    少样本提示技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../part2/COT.html">
            
                <a href="../part2/COT.html">
            
                    
                    链式思考（CoT）提示
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../part2/RAG.html">
            
                <a href="../part2/RAG.html">
            
                    
                    检索增强生成 (RAG)提示
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../part2/TOT.html">
            
                <a href="../part2/TOT.html">
            
                    
                    思维树 (ToT)提示
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../part3/">
            
                <a href="../part3/">
            
                    
                    应用案例
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../part3/">
            
                <a href="../part3/">
            
                    
                    软件工程领域
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="../part3/software-engineering/test-engineer.html">
            
                <a href="../part3/software-engineering/test-engineer.html">
            
                    
                    测试工程师
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="../part3/software-engineering/product-manager.html">
            
                <a href="../part3/software-engineering/product-manager.html">
            
                    
                    产品经理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.3" data-path="../part3/software-engineering/development-engineer.html">
            
                <a href="../part3/software-engineering/development-engineer.html">
            
                    
                    研发工程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" data-path="../part3/software-engineering/operation.html">
            
                <a href="../part3/software-engineering/operation.html">
            
                    
                    互联网运营
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../part3/feedback_please.md">
            
                <span>
            
                    
                    教育培训领域
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../part3/better_tools.md">
            
                <span>
            
                    
                    文化娱乐领域
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    [潜在风险]
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" >
            
                <span>
            
                    
                    [对抗性提示]
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    [回答偏见]
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >提示词通用技巧</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8BBE;&#x8BA1;&#x63D0;&#x793A;&#x7684;&#x901A;&#x7528;&#x6280;&#x5DE7;">&#x8BBE;&#x8BA1;&#x63D0;&#x793A;&#x7684;&#x901A;&#x7528;&#x6280;&#x5DE7;</h1>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x8BBE;&#x8BA1;&#x63D0;&#x793A;&#x65F6;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x5DE7;&#xFF1A;</p>
<h2 id="&#x4ECE;&#x7B80;&#x5355;&#x5F00;&#x59CB;">&#x4ECE;&#x7B80;&#x5355;&#x5F00;&#x59CB;</h2>
<p>&#x5728;&#x8BBE;&#x8BA1;&#x63D0;&#x793A;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x5B9E;&#x9A8C;&#x6765;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x7ED3;&#x679C;&#x3002;&#x4F7F;&#x7528;&#x50CF; OpenAI &#x6216; Cohere &#x8FD9;&#x6837;&#x7684;&#x7B80;&#x5355;&#x5E73;&#x53F0;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x8D77;&#x70B9;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x4ECE;&#x7B80;&#x5355;&#x7684;&#x63D0;&#x793A;&#x5F00;&#x59CB;&#xFF0C;&#x968F;&#x7740;&#x60A8;&#x7684;&#x76EE;&#x6807;&#x662F;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E0D;&#x65AD;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x5143;&#x7D20;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#x5BF9;&#x60A8;&#x7684;&#x63D0;&#x793A;&#x8FDB;&#x884C;&#x7248;&#x672C;&#x63A7;&#x5236;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5F53;&#x60A8;&#x9605;&#x8BFB;&#x672C;&#x6307;&#x5357;&#x65F6;&#xFF0C;&#x60A8;&#x4F1A;&#x770B;&#x5230;&#x8BB8;&#x591A;&#x4F8B;&#x5B50;&#xFF0C;&#x5176;&#x4E2D;&#x5177;&#x4F53;&#x6027;&#x3001;&#x7B80;&#x6D01;&#x6027;&#x548C;&#x7B80;&#x660E;&#x6027;&#x901A;&#x5E38;&#x4F1A;&#x7ED9;&#x60A8;&#x5E26;&#x6765;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5F53;&#x60A8;&#x6709;&#x4E00;&#x4E2A;&#x6D89;&#x53CA;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x5B50;&#x4EFB;&#x52A1;&#x7684;&#x5927;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x5C06;&#x4EFB;&#x52A1;&#x5206;&#x89E3;&#x4E3A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5B50;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x968F;&#x7740;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x800C;&#x4E0D;&#x65AD;&#x6784;&#x5EFA;&#x3002;&#x8FD9;&#x907F;&#x514D;&#x4E86;&#x5728;&#x63D0;&#x793A;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x6DFB;&#x52A0;&#x8FC7;&#x591A;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<h2 id="&#x6307;&#x4EE4;">&#x6307;&#x4EE4;</h2>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x6765;&#x6307;&#x793A;&#x6A21;&#x578B;&#x6267;&#x884C;&#x5404;&#x79CD;&#x7B80;&#x5355;&#x4EFB;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x5199;&#x5165;&#x201D;&#x3001;&#x201C;&#x5206;&#x7C7B;&#x201D;&#x3001;&#x201C;&#x603B;&#x7ED3;&#x201D;&#x3001;&#x201C;&#x7FFB;&#x8BD1;&#x201D;&#x3001;&#x201C;&#x6392;&#x5E8F;&#x201D;&#x7B49;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x5404;&#x79CD;&#x7B80;&#x5355;&#x4EFB;&#x52A1;&#x8BBE;&#x8BA1;&#x6709;&#x6548;&#x7684;&#x63D0;&#x793A;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x60A8;&#x8FD8;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x7684;&#x5B9E;&#x9A8C;&#xFF0C;&#x4EE5;&#x67E5;&#x770B;&#x54EA;&#x79CD;&#x65B9;&#x6CD5;&#x6700;&#x6709;&#x6548;&#x3002;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5173;&#x952E;&#x5B57;&#x3001;&#x4E0A;&#x4E0B;&#x6587;&#x548C;&#x6570;&#x636E;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x770B;&#x770B;&#x54EA;&#x79CD;&#x65B9;&#x6CD5;&#x6700;&#x9002;&#x5408;&#x60A8;&#x7684;&#x7279;&#x5B9A;&#x7528;&#x4F8B;&#x548C;&#x4EFB;&#x52A1;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0A;&#x4E0B;&#x6587;&#x4E0E;&#x60A8;&#x8981;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x8D8A;&#x5177;&#x4F53;&#x548C;&#x76F8;&#x5173;&#xFF0C;&#x6548;&#x679C;&#x8D8A;&#x597D;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x5373;&#x5C06;&#x63A8;&#x51FA;&#x7684;&#x6307;&#x5357;&#x4E2D;&#x4ECB;&#x7ECD;&#x91C7;&#x6837;&#x548C;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x4EBA;&#x5EFA;&#x8BAE;&#x5C06;&#x6307;&#x4EE4;&#x653E;&#x5728;&#x63D0;&#x793A;&#x7684;&#x5F00;&#x5934;&#x3002;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x6E05;&#x6670;&#x7684;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x5982;&#x201C;###&#x201D;&#xFF0C;&#x6765;&#x5206;&#x9694;&#x6307;&#x4EE4;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<p>&#x63D0;&#x793A;&#xFF1A;</p>
<pre><code>&#x5C06;&#x4EE5;&#x4E0B;&#x6587;&#x672C;&#x7FFB;&#x8BD1;&#x6210;&#x897F;&#x73ED;&#x7259;&#x8BED;&#xFF1A;
&#x6587;&#x672C;&#xFF1A;&#x201C;hello&#xFF01;&#x201D;
&#x8F93;&#x51FA;&#xFF1A;
&#xA1;Hola!
</code></pre><h2 id="&#x5177;&#x4F53;&#x6027;">&#x5177;&#x4F53;&#x6027;</h2>
<p>&#x5BF9;&#x60A8;&#x5E0C;&#x671B;&#x6A21;&#x578B;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x548C;&#x4EFB;&#x52A1;&#x975E;&#x5E38;&#x5177;&#x4F53;&#x3002;&#x63D0;&#x793A;&#x8D8A;&#x5177;&#x4F53;&#x548C;&#x8BE6;&#x7EC6;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x8D8A;&#x597D;&#x3002;&#x5F53;&#x60A8;&#x6709;&#x6240;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#x6216;&#x751F;&#x6210;&#x6837;&#x5F0F;&#x65F6;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x6CA1;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x4EE4;&#x724C;&#x6216;&#x5173;&#x952E;&#x5B57;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x683C;&#x5F0F;&#x548C;&#x63CF;&#x8FF0;&#x6027;&#x63D0;&#x793A;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x63D0;&#x793A;&#x4E2D;&#x63D0;&#x4F9B;&#x793A;&#x4F8B;&#x975E;&#x5E38;&#x6709;&#x6548;&#xFF0C;&#x53EF;&#x4EE5;&#x4EE5;&#x7279;&#x5B9A;&#x683C;&#x5F0F;&#x83B7;&#x5F97;&#x6240;&#x9700;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x5728;&#x8BBE;&#x8BA1;&#x63D0;&#x793A;&#x65F6;&#xFF0C;&#x60A8;&#x8FD8;&#x5E94;&#x8003;&#x8651;&#x63D0;&#x793A;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x63D0;&#x793A;&#x7684;&#x957F;&#x5EA6;&#x6709;&#x9650;&#x5236;&#x3002;&#x8003;&#x8651;&#x5230;&#x60A8;&#x5E94;&#x8BE5;&#x5177;&#x4F53;&#x548C;&#x8BE6;&#x7EC6;&#x7684;&#x7A0B;&#x5EA6;&#x662F;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x3002;&#x5305;&#x542B;&#x592A;&#x591A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x5E94;&#x8BE5;&#x662F;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x5E76;&#x6709;&#x52A9;&#x4E8E;&#x5B8C;&#x6210;&#x624B;&#x5934;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x662F;&#x60A8;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x5B9E;&#x9A8C;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x4EEC;&#x9F13;&#x52B1;&#x5927;&#x91CF;&#x5B9E;&#x9A8C;&#x548C;&#x8FED;&#x4EE3;&#xFF0C;&#x4EE5;&#x4F18;&#x5316;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x63D0;&#x793A;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x4ECE;&#x4E00;&#x6BB5;&#x6587;&#x672C;&#x4E2D;&#x63D0;&#x53D6;&#x7279;&#x5B9A;&#x4FE1;&#x606F;&#x7684;&#x7B80;&#x5355;&#x63D0;&#x793A;&#x3002;</p>
<p>&#x63D0;&#x793A;&#xFF1A;</p>
<pre><code>&#x63D0;&#x53D6;&#x4EE5;&#x4E0B;&#x6587;&#x672C;&#x4E2D;&#x7684;&#x5730;&#x540D;&#x3002;
&#x6240;&#x9700;&#x683C;&#x5F0F;&#xFF1A;
&#x5730;&#x70B9;&#xFF1A;&lt;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x516C;&#x53F8;&#x540D;&#x79F0;&#x5217;&#x8868;&gt;
&#x8F93;&#x5165;&#xFF1A;&#x201C;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x53D1;&#x5C55;&#x5BF9;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#x662F;&#x4EE4;&#x4EBA;&#x9F13;&#x821E;&#x7684;&#xFF0C;&#x4F46;&#x4ECD;&#x6709;&#x8BB8;&#x591A;&#x8C1C;&#x56E2;&#x3002;&#x91CC;&#x65AF;&#x672C;&#x672A;&#x77E5;&#x7684;&#x9999;&#x5E15;&#x5229;&#x83AB;&#x5FB7;&#x4E2D;&#x5FC3;&#x7684;&#x795E;&#x7ECF;&#x514D;&#x75AB;&#x5B66;&#x5BB6;Henrique Veiga-Fernandes&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x5728;&#x5927;&#x8111;&#x548C;&#x6211;&#x4EEC;&#x5728;&#x5468;&#x56F4;&#x770B;&#x5230;&#x7684;&#x6548;&#x679C;&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x4E2A;&#x9ED1;&#x5323;&#x5B50;&#x3002;&#x201D;&#x201C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x5728;&#x6CBB;&#x7597;&#x80CC;&#x666F;&#x4E0B;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x673A;&#x5236;&#x3002;&#x201D;&#x201D;
&#x8F93;&#x51FA;&#xFF1A;

&#x5730;&#x70B9;&#xFF1A;&#x91CC;&#x65AF;&#x672C;&#xFF0C;&#x9999;&#x5E15;&#x5229;&#x83AB;&#x5FB7;&#x4E2D;&#x5FC3;
&#x8F93;&#x5165;&#x6587;&#x672C;&#x6765;&#x81EA;&#x8FD9;&#x7BC7;Nature&#x6587;&#x7AE0;(opens in a new tab)&#x3002;
</code></pre><h3 id="&#x907F;&#x514D;&#x4E0D;&#x7CBE;&#x786E;">&#x907F;&#x514D;&#x4E0D;&#x7CBE;&#x786E;</h3>
<p>&#x5728;&#x4E0A;&#x9762;&#x5173;&#x4E8E;&#x8BE6;&#x7EC6;&#x548C;&#x683C;&#x5F0F;&#x6539;&#x8FDB;&#x7684;&#x63D0;&#x793A;&#x4E2D;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x60F3;&#x8981;&#x8FC7;&#x4E8E;&#x806A;&#x660E;&#x7684;&#x63D0;&#x793A;&#x9677;&#x9631;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x4E0D;&#x7CBE;&#x786E;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x901A;&#x5E38;&#x6700;&#x597D;&#x662F;&#x5177;&#x4F53;&#x548C;&#x76F4;&#x63A5;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x7C7B;&#x6BD4;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;&#x6709;&#x6548;&#x7684;&#x6C9F;&#x901A;&#x2014;&#x2014;&#x8D8A;&#x76F4;&#x63A5;&#xFF0C;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x5C31;&#x8D8A;&#x6709;&#x6548;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x6709;&#x5174;&#x8DA3;&#x4E86;&#x89E3;&#x63D0;&#x793A;&#x5DE5;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>
<p>&#x89E3;&#x91CA;&#x63D0;&#x793A;&#x5DE5;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x4FDD;&#x6301;&#x89E3;&#x91CA;&#x7B80;&#x77ED;&#xFF0C;&#x53EA;&#x6709;&#x51E0;&#x53E5;&#x8BDD;&#xFF0C;&#x4E0D;&#x8981;&#x8FC7;&#x4E8E;&#x63CF;&#x8FF0;&#x3002;
&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x63D0;&#x793A;&#x4E2D;&#x4E0D;&#x6E05;&#x695A;&#x8981;&#x4F7F;&#x7528;&#x591A;&#x5C11;&#x53E5;&#x8BDD;&#x548C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x98CE;&#x683C;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x63D0;&#x793A;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x4F46;&#x66F4;&#x597D;&#x7684;&#x63D0;&#x793A;&#x662F;&#x975E;&#x5E38;&#x5177;&#x4F53;&#x3001;&#x7B80;&#x6D01;&#x548C;&#x76F4;&#x63A5;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E2A;&#x7535;&#x5F71;&#x63A8;&#x8350;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5199;&#x7684;&#x6307;&#x4EE4;&#x2014;&#x2014;&#x5173;&#x6CE8;&#x4E8E;&#x4E0D;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x5931;&#x8D25;&#x4E86;&#x3002;</p>
<p>&#x63D0;&#x793A;&#xFF1A;</p>
<pre><code>&#x4EE5;&#x4E0B;&#x662F;&#x5411;&#x5BA2;&#x6237;&#x63A8;&#x8350;&#x7535;&#x5F71;&#x7684;&#x4EE3;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x4E0D;&#x8981;&#x8BE2;&#x95EE;&#x5174;&#x8DA3;&#x3002;&#x4E0D;&#x8981;&#x8BE2;&#x95EE;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x3002;
&#x5BA2;&#x6237;&#xFF1A;&#x8BF7;&#x6839;&#x636E;&#x6211;&#x7684;&#x5174;&#x8DA3;&#x63A8;&#x8350;&#x7535;&#x5F71;&#x3002;
&#x4EE3;&#x7406;&#xFF1A;
&#x8F93;&#x51FA;&#xFF1A;

&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x60A8;&#x7684;&#x5174;&#x8DA3;&#x63A8;&#x8350;&#x7535;&#x5F71;&#x3002;&#x60A8;&#x60F3;&#x770B;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x7535;&#x5F71;&#xFF1F;&#x60A8;&#x559C;&#x6B22;&#x52A8;&#x4F5C;&#x7247;&#x3001;&#x559C;&#x5267;&#x7247;&#x3001;&#x7231;&#x60C5;&#x7247;&#x8FD8;&#x662F;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x7535;&#x5F71;&#xFF1F;
&#x4EE5;&#x4E0B;&#x662F;&#x66F4;&#x597D;&#x7684;&#x63D0;&#x793A;&#xFF1A;
</code></pre><p>&#x63D0;&#x793A;&#xFF1A;</p>
<pre><code>&#x4EE5;&#x4E0B;&#x662F;&#x5411;&#x5BA2;&#x6237;&#x63A8;&#x8350;&#x7535;&#x5F71;&#x7684;&#x4EE3;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x4EE3;&#x7406;&#x8D1F;&#x8D23;&#x4ECE;&#x5168;&#x7403;&#x70ED;&#x95E8;&#x7535;&#x5F71;&#x4E2D;&#x63A8;&#x8350;&#x7535;&#x5F71;&#x3002;&#x5B83;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x8BE2;&#x95EE;&#x7528;&#x6237;&#x7684;&#x504F;&#x597D;&#x5E76;&#x907F;&#x514D;&#x8BE2;&#x95EE;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7406;&#x6CA1;&#x6709;&#x7535;&#x5F71;&#x63A8;&#x8350;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x56DE;&#x7B54;&#x201C;&#x62B1;&#x6B49;&#xFF0C;&#x4ECA;&#x5929;&#x627E;&#x4E0D;&#x5230;&#x7535;&#x5F71;&#x63A8;&#x8350;&#x3002;&#x201D;&#x3002;
&#x987E;&#x5BA2;&#xFF1A;&#x8BF7;&#x6839;&#x636E;&#x6211;&#x7684;&#x5174;&#x8DA3;&#x63A8;&#x8350;&#x4E00;&#x90E8;&#x7535;&#x5F71;&#x3002;
&#x5BA2;&#x670D;&#xFF1A;
&#x8F93;&#x51FA;&#xFF1A;

&#x62B1;&#x6B49;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x5173;&#x4E8E;&#x60A8;&#x5174;&#x8DA3;&#x7684;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x662F;&#x76EE;&#x524D;&#x5168;&#x7403;&#x70ED;&#x95E8;&#x7684;&#x7535;&#x5F71;&#x5217;&#x8868;&#xFF1A;[&#x7535;&#x5F71;&#x5217;&#x8868;]&#x3002;&#x5E0C;&#x671B;&#x60A8;&#x80FD;&#x627E;&#x5230;&#x559C;&#x6B22;&#x7684;&#x7535;&#x5F71;&#xFF01;
</code></pre><p>&#x4E0A;&#x8FF0;&#x793A;&#x4F8B;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5185;&#x5BB9;&#x6458;&#x81EA;&quot;Best practices for prompt engineering with OpenAI API&quot; article.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="element.html" class="navigation navigation-prev " aria-label="Previous page: 提示词要素">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../part2/" class="navigation navigation-next " aria-label="Next page: 提示词技术介绍">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"提示词通用技巧","level":"1.2.3","depth":2,"next":{"title":"提示词技术介绍","level":"1.3","depth":1,"path":"part2/README.md","ref":"part2/README.md","articles":[{"title":"零样本提示技术","level":"1.3.1","depth":2,"path":"part2/zero-shot.md","ref":"part2/zero-shot.md","articles":[]},{"title":"少样本提示技术","level":"1.3.2","depth":2,"path":"part2/few-shot.md","ref":"part2/few-shot.md","articles":[]},{"title":"链式思考（CoT）提示","level":"1.3.3","depth":2,"path":"part2/COT.md","ref":"part2/COT.md","articles":[]},{"title":"检索增强生成 (RAG)提示","level":"1.3.4","depth":2,"path":"part2/RAG.md","ref":"part2/RAG.md","articles":[]},{"title":"思维树 (ToT)提示","level":"1.3.5","depth":2,"path":"part2/TOT.md","ref":"part2/TOT.md","articles":[]}]},"previous":{"title":"提示词要素","level":"1.2.2","depth":2,"path":"part1/element.md","ref":"part1/element.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part1/General-tips.md","mtime":"2023-10-25T03:24:44.541Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-10-25T03:25:19.021Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

